---
kind: type
id: T:Autodesk.Revit.DB.WorksetFilter
source: html/fa63f74c-8dee-019b-41c9-33aa48443f98.htm
---
# Autodesk.Revit.DB.WorksetFilter

A base class for a type of filter that accepts or rejects worksets based upon criteria.

## Syntax (C#)
```csharp
public class WorksetFilter : IDisposable
```